<center><h1><b>Student Data Analysis</h1></center>

# Understanding the Data   
The dataset contains information about students, including attributes such as their names or IDs and different academic or demographic details (for example, marks scored, subjects taken, age, or class depending on the file contents). By loading and previewing the first few rows, we can get an overview of how the data is structured, the type of each column, and whether there are any missing or unusual values. This understanding is essential before proceeding to clean, analyse, or visualise the data, as it clarifies what each column represents and what insights can be drawn from the dataset.

## 1) Importing Required Libraries

In [12]:
#Importing Required Libraries
import numpy as np
import pandas as pd

## 2) Reading Data

In [13]:
#Reading data
students = pd.read_csv(r"S:\Jupyter Notebook\Data Science Internship/Dataset/students_20.csv")
print(students)

   Student Name  Math  Science  English
0         Aarav    75      100       86
1          Diya    91       73       93
2         Kabir    94       89       94
3         Meera    88       97       73
4        Ishaan    77       80       74
5        Ananya    72       90       72
6         Rohan    90       81       80
7         Sanya    89       77       90
8         Arjun    73       81       84
9         Priya    72       70       75
10       Vihaan    91       77       79
11        Nisha    89       85       70
12       Aditya    78       94       72
13        Kavya    75       75       76
14        Manav    87       96       80
15       Ritika    75       89       75
16        Karan    80       94       97
17       Simran    87       90       72
18          Dev    83       77       91
19        Pooja    75       77       94

## 3) Data Exploration

### i) First 5 Records:

In [14]:
#Show the first 5 rows of the DataFrame.
students.head()

  Student Name  Math  Science  English
0        Aarav    75      100       86
1         Diya    91       73       93
2        Kabir    94       89       94
3        Meera    88       97       73
4       Ishaan    77       80       74

### ii) Last 5 Records:

In [15]:
#tail of the data:
students.tail()

   Student Name  Math  Science  English
15       Ritika    75       89       75
16        Karan    80       94       97
17       Simran    87       90       72
18          Dev    83       77       91
19        Pooja    75       77       94

# II) Understanding Variables

## 1) Overview of Dataset Variables

### i) Column Names

In [16]:
#Column names:
print('Colums Names:')
print(students.columns)

Colums Names:
Index(['Student Name', 'Math', 'Science', 'English'], dtype='object')

### ii) Overview of Column Data Types:

In [17]:
#Datatypes:
print('Data Types:')
print(students.dtypes)

Data Types:
Student Name    object
Math             int64
Science          int64
English          int64
dtype: object

## 2) Statistical Summary of Numerical Variables

In [18]:
#Describing the data:
students.describe()

            Math     Science    English
count  20.000000   20.000000  20.000000
mean   82.050000   84.600000  81.350000
std     7.528717    8.923063   8.975258
min    72.000000   70.000000  70.000000
25%    75.000000   77.000000  73.750000
50%    81.500000   83.000000  79.500000
75%    89.000000   91.000000  90.250000
max    94.000000  100.000000  97.000000

## 3) Checking

### i) Information Summary:

In [19]:
#Information Summary:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Student Name  20 non-null     object
 1   Math          20 non-null     int64
 2   Science       20 non-null     int64
 3   English       20 non-null     int64
dtypes: int64(3), object(1)
memory usage: 772.0+ bytes

### ii) Shape of the Data:

In [20]:
#Shape of the Data
students.shape

(20, 4)

# III) Data Wrangling

## 1) Checking missing/null values

In [21]:
#Count of Missing Entries:
x = students.isnull().sum()
print(x)

Student Name    0
Math            0
Science         0
English         0
dtype: int64

# IV) Exploratory Data Analysis

## 1) Displaying Student Names with their Math Marks

In [22]:
#Show only the "Student Name" and "Math" columns.
print(students[['Student Name','Math']])

   Student Name  Math
0         Aarav    75
1          Diya    91
2         Kabir    94
3         Meera    88
4        Ishaan    77
5        Ananya    72
6         Rohan    90
7         Sanya    89
8         Arjun    73
9         Priya    72
10       Vihaan    91
11        Nisha    89
12       Aditya    78
13        Kavya    75
14        Manav    87
15       Ritika    75
16        Karan    80
17       Simran    87
18          Dev    83
19        Pooja    75

## 2) Average Marks by Subject

In [23]:
#Find the average marks in each subject.
print(students[['Math','Science','English']].mean())

Math       82.05
Science    84.60
English    81.35
dtype: float64

## 3) Top Scorers in Science

In [24]:
#Which student scored the highest in Science?
max_mark = students['Science'].max()
stu_name = students[students['Science'] == max_mark]
print(stu_name)
print(max_mark)

  Student Name  Math  Science  English
0        Aarav    75      100       86
100

## 4) Identifying the Students with the Highest Science Mark

In [25]:
#Identifying the Students with the Highest Science Mark
stu = students['Science'].max()
stu_ = students.loc[students['Science'] == stu, 'Student Name']
print(stu)
print(stu_)

100
0    Aarav
Name: Student Name, dtype: object

## 5) Students Who Scored More Than 90 Marks in English

In [26]:
#Select students who scored more than 90 in English.
x = students[students['English'] > 90]
print(x)

   Student Name  Math  Science  English
1          Diya    91       73       93
2         Kabir    94       89       94
16        Karan    80       94       97
18          Dev    83       77       91
19        Pooja    75       77       94

## 6) Students Sorted by Math Marks in Descending Order

In [27]:
#Sort students by Math marks in descending order.
y = students.sort_values('Math', ascending=False)[['Student Name','Math']]
print(y)

   Student Name  Math
2         Kabir    94
1          Diya    91
10       Vihaan    91
6         Rohan    90
11        Nisha    89
7         Sanya    89
3         Meera    88
17       Simran    87
14        Manav    87
18          Dev    83
16        Karan    80
12       Aditya    78
4        Ishaan    77
0         Aarav    75
15       Ritika    75
13        Kavya    75
19        Pooja    75
8         Arjun    73
9         Priya    72
5        Ananya    72

## 7) Calculating and Adding a Total Marks Column for Each Student

In [28]:
#Add a new column "Total" = Math + Science + English
students['Total'] = students['Math'] + students['English'] + students ['Science']
print(students)

   Student Name  Math  Science  English  Total
0         Aarav    75      100       86    261
1          Diya    91       73       93    257
2         Kabir    94       89       94    277
3         Meera    88       97       73    258
4        Ishaan    77       80       74    231
5        Ananya    72       90       72    234
6         Rohan    90       81       80    251
7         Sanya    89       77       90    256
8         Arjun    73       81       84    238
9         Priya    72       70       75    217
10       Vihaan    91       77       79    247
11        Nisha    89       85       70    244
12       Aditya    78       94       72    244
13        Kavya    75       75       76    226
14        Manav    87       96       80    263
15       Ritika    75       89       75    239
16        Karan    80       94       97    271
17       Simran    87       90       72    249
18          Dev    83       77       91    251
19        Pooja    75       77       94    246

## 8) Identifying the Students with the Highest Total Marks

In [29]:
#Find the student with the highest total marks.
x = students['Total'].max()
x_ = students.loc[students['Total'] == x,'Student Name']
print(x)
print(x_)

277
2    Kabir
Name: Student Name, dtype: object

## 9) Students Scoring Above 80 Marks in Any Subject

In [30]:
#Show students who scored less than 80 in at least one subject
x = students[(students['Math'] > 80) | (students['Science'] > 80) |(students['English'] > 80)]
print(x)

   Student Name  Math  Science  English  Total
0         Aarav    75      100       86    261
1          Diya    91       73       93    257
2         Kabir    94       89       94    277
3         Meera    88       97       73    258
5        Ananya    72       90       72    234
6         Rohan    90       81       80    251
7         Sanya    89       77       90    256
8         Arjun    73       81       84    238
10       Vihaan    91       77       79    247
11        Nisha    89       85       70    244
12       Aditya    78       94       72    244
14        Manav    87       96       80    263
15       Ritika    75       89       75    239
16        Karan    80       94       97    271
17       Simran    87       90       72    249
18          Dev    83       77       91    251
19        Pooja    75       77       94    246

## 10) Highest and Lowest Marks in Math

In [31]:
#What is the highest and lowest mark in Math?
x = students['Math'].max()
y = students['Math'].min()
print(x)
print(y)

94
72

## 11) Average (Mean) of Total Marks of All Students

In [32]:
#Find the average total marks of all students.
totals = students["Total"].mean()
print(totals)

248.0

## 12) Top 3 Students with the Highest English Marks

In [33]:
#Top 3 Students with the Highest English Marks
top_english = students.sort_values("English", ascending=False)[['Student Name','English']]
print(top_english.head(3))

   Student Name  English
16        Karan       97
2         Kabir       94
19        Pooja       94

## 13) Count of Students Scoring More Than 85 Marks in Science

In [34]:
#Count of Students Scoring More Than 85 Marks in Science
mask = students["Science"] > 85
count = mask.sum()
print(count)

9

## 14) Top 5 Students by Total Marks

In [35]:
#Show the top 5 students based on total marks (Student Name + Total)
top5_students = students[["Student Name","Total"]].sort_values("Total", ascending=False)
print(top5_students.head(5))

   Student Name  Total
2         Kabir    277
16        Karan    271
14        Manav    263
0         Aarav    261
3         Meera    258

## 15) Saving the Updated Students Marks DataFrame to a CSV File

In [38]:
#Save the updated DataFrame (with totals) to a new CSV.
students.to_csv('Updated_Students_Marks_20.csv',index=False)